package xingweixing.day06_visitor;
/**
 * 观察者模式：
 * 
 * 模式动机：对于存储在一个集合中的对象，他们可能具有不同的类型（即使有一个公共的接口），
 *           对于该集合中的对象，可以接受一类称为访问者的对象来访问，
 *           不同的访问者访问的方式有所不同。
 *           
 * 定义：表示一个作用与某对象结构中的各个元素的操作，它使我们可以在不改变元素类的前提下
 *       定义作用于这些元素的新操作。
 *       
 * 开发中的应用场景（应用范围非常窄，了解即可）：
 *                                            --XML文档解析器设计
 *                                            --编译器的设计
 *                                            --复杂集合对象的处理
 * @author HY
 *
 */
public class Info {

}
